#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Sat Mar 27 11:08:03 2021

@author: bynav
"""

import numpy as np
 
 
####################仅仅是一个示例###################################
 
 
# 双目相机参数
class stereoCamera(object):
    def __init__(self):
        # 左相机内参
        self.cam_matrix_left = np.array([[906.052143341671, 0, 662.035976643843],
                                         [0., 909.810278518771, 347.812877929693],
                                         [0., 0., 1.]])
        # 右相机内参
        self.cam_matrix_right = np.array([[904.039816599602, 0, 657.374726861859],
                                          [0., 907.144037650865, 371.505562447014],
                                          [0., 0., 1.]])
 
        # 左右相机畸变系数:[k1, k2, p1, p2, k3]
        self.distortion_l = np.array([[0.00069451800687876, 0.0526241964124028, -0.00395258899740901, 0.0029474338458693, -0.135921756945649]])
        self.distortion_r = np.array([[0.00503605508798055, 0.0137569348762201, -0.00339148012519355, 0.00274948038873249, -0.0691817876373664]])
 
        # 旋转矩阵
        self.R = np.array([[0.999999944353214, 0.000141559982260522, 0.00030208333489573],
                           [-0.000141022307976901, 0.999998407337637, -0.00177916691099839],
                           [-0.000302334712615328, 0.00177912421150438, 0.999998371654055]])
 
        # 平移矩阵
        self.T = np.array([[-44.7734208533592], [0.329530613742665], [-0.453620226449132]])
 
        # 焦距 unit:pixel
        self.focal_length = 474.81  # 默认值，一般取立体校正后的重投影矩阵Q中的 Q[2,3]
 
        # 基线距离
        self.baseline = 44.7734208533592  # 单位：mm， 为平移向量的第一个参数（取绝对值）
        
        # pixel size unit: mm
        self.pixel_size = 0.0003